# InputMemberIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionInputPointInfo..::..InputMemberIndex Property
ConnectionInputPointInfo Class See Also
---
A index of the input member to which the restriction applies.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public int InputMemberIndex { get; set; }
```

Visual Basic
---
```text
Public Property InputMemberIndex As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int InputMemberIndex {
	int get ();
	void set (int value);
}
```

# See Also
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace